app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2018-05-15 21:20:30.200603"], ["updated_at", "2018-05-15 21:20:30.200603"]]
SELECT  "artists".* FROM "artists" WHERE (.38 Special) LIMIT 1
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |file|
      song = Song.create(title: file[0])
      song.artist = Artist.find_or_create_by(file[1])